In [1]:
import pandas as pd

[Перевод строковых значений в числа](#str_to_num)

«Определить, какие товарные категории и подкатегории на сайте представлены в поисковиках хуже всего»

In [2]:
data = pd.read_excel('seo_data.xlsx',sheet_name='traffic_data')

In [3]:
display(data.info())
data.head(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1930 entries, 0 to 1929
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1930 non-null   object
 1   source          1930 non-null   object
 2   visits          1930 non-null   object
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), object(3)
memory usage: 60.4+ KB

None

  subcategory_id  source         visits  Unnamed: 3
0     cf2e61c7af  direct  501165.668858         NaN
1     0cd903d1cc  direct  126342.359505         NaN
2     ef35bc88a7  direct   95626.321402         NaN
3     6ff9f4014c  direct   75680.653002         NaN
4     72bc238e4d  direct   64435.934651         NaN
5     88c78ea685  direct   39638.202995         NaN
6     179bfacf4a  direct   31007.471245         NaN
7     b0fb8f259a  direct   30324.097324         NaN
8     3c67eb2d90  direct   25878.814329         NaN
9     24e6c815c6  direct   25276.373358         NaN

In [4]:
data['source'].unique()

array(['direct', 'organic'], dtype=object)

In [5]:
subcategory_dict = pd.read_excel('seo_data.xlsx',sheet_name= 'subcategory_ids')

In [6]:
subcategory_dict.head(10)

  subcategory_id                subcategory_name category_id
0     cf2e61c7af              Мобильные телефоны  09f279a643
1     0cd903d1cc                        Ноутбуки  3509869a61
2     ef35bc88a7                      Телевизоры  09f279a643
3     6ff9f4014c                        Планшеты  3509869a61
4     72bc238e4d  Наушники и Bluetooth-гарнитуры  09f279a643
5     88c78ea685                            Шины  65922fa39c
6     179bfacf4a           Умные часы и браслеты  09f279a643
7     b0fb8f259a                        Мониторы  3509869a61
8     3c67eb2d90                   Наручные часы  6074ad29ac
9     24e6c815c6  Лекарственные препараты и БАДы  10a493e03b

In [7]:
category_dict = pd.read_excel('seo_data.xlsx',sheet_name= 'category_ids')

In [8]:
category_dict.head(10)

  category_id               category_name
0  09f279a643                 Электроника
1  3509869a61        Компьютерная техника
2  65922fa39c                        Авто
3  6074ad29ac  Одежда, обувь и аксессуары
4  10a493e03b         Товары для здоровья
5  5a0d8ac946             Бытовая техника
6  7dbac4c1a3              Детские товары
7  ae99947659               Спорт и отдых
8  655ccc3c49          Товары для красоты
9  394f20d8fa      Строительство и ремонт

In [9]:
print(data.groupby('source')['source'].count())

source
direct     965
organic    965
Name: source, dtype: int64

In [10]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1930 entries, 0 to 1929
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1930 non-null   object
 1   source          1930 non-null   object
 2   visits          1930 non-null   object
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), object(3)
memory usage: 60.4+ KB
None

## Перевод строковых значений в числа
<a id='str_to_num'></a>

In [11]:
transactions = pd.read_excel('ids.xlsx')

In [12]:
display(transactions['category'].unique())
transactions.head()

array(['C', 'B', 'D', 'A', 'E', 'Null'], dtype=object)

             id category    amount
0  600748331392        C  17515.36
1  600748331404        B  10117.56
2  600748331412        B  18489.26
3  600748331430        B   6620.22
4  600748331447        C    7559.9

In [13]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        49 non-null     object
 1   category  49 non-null     object
 2   amount    49 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

transactions['amount'] = pd.to_numeric(transactions['amount']) 


У метода to_numeric() есть параметр errors. От значений, принимаемых errors, зависят действия to_numeric при встрече с некорректным значением:
`errors='raise' — дефолтное поведение: при встрече с некорректным значением выдаётся ошибка, операция перевода в числа прерывается;


`errors='coerce' — некорректные значения принудительно заменяются на NaN;


`errors='ignore' — некорректные значения игнорируются, но остаются.


transactions['amount'] = pd.to_numeric(transactions['amount'], errors='coerce') 
Методом to_numeric() мы не только превратим строки в числовой тип там, где это возможно, но и выясним, на каких значениях метод не работает.
Особенность метода to_numeric() в том, что при переводе все числа будут иметь тип данных float. Это подходит далеко не всем значениям. Но есть и хорошие новости: в нужный тип значения переводят методом astype(). Например, аргумент ('int') метода astype() означает, что значение нужно перевести в целое число:

In [14]:
transactions['id'] = pd.to_numeric(transactions['id'],errors='coerce')

In [15]:
transactions['id'].tail(5)

44    6.007483e+11
45    6.007483e+11
46    6.007483e+11
47    6.007483e+11
48             NaN
Name: id, dtype: float64

In [16]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        48 non-null     float64
 1   category  49 non-null     object
 2   amount    49 non-null     object
dtypes: float64(1), object(2)
memory usage: 1.3+ KB

In [17]:
transactions['amount'] = pd.to_numeric(transactions['amount'],errors='coerce')

In [18]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        48 non-null     float64
 1   category  49 non-null     object
 2   amount    45 non-null     float64
dtypes: float64(2), object(1)
memory usage: 1.3+ KB

In [19]:
transactions['amount'].sum()

596107.1


Рассчитайте сумму продаж для каждой категории и сохраните в переменной transactions_per_category. Для этого сгруппируйте датафрейм transactions по столбцу category и примените метод sum() к столбцу amount. Выведите результат на экран.

In [20]:
 transactions_per_category = transactions.groupby('category')['amount'].sum()

In [21]:
print(transactions_per_category)

category
A       133988.50
B       168617.89
C       173332.50
D        62630.82
E        57537.39
Null         0.00
Name: amount, dtype: float64

In [22]:
data

     subcategory_id   source         visits  Unnamed: 3
0        cf2e61c7af   direct  501165.668858         NaN
1        0cd903d1cc   direct  126342.359505         NaN
2        ef35bc88a7   direct   95626.321402         NaN
3        6ff9f4014c   direct   75680.653002         NaN
4        72bc238e4d   direct   64435.934651         NaN
...             ...      ...            ...         ...
1925     c51343bf77  organic      15.640773         NaN
1926     d942687638  organic       13.87554         NaN
1927     976642886f  organic       9.204211         NaN
1928     075994491e  organic       4.606261         NaN
1929          total  organic      "5687882"         NaN

[1930 rows x 4 columns]

In [23]:
pd.to_numeric(data['visits'])

ValueError: Unable to parse string ""2369468"" at position 964

In [24]:
data.loc[964]

subcategory_id        total
source               direct
visits            "2369468"
Unnamed: 3              NaN
Name: 964, dtype: object

In [25]:
data[data['subcategory_id']=='total']

     subcategory_id   source     visits  Unnamed: 3
964           total   direct  "2369468"         NaN
1929          total  organic  "5687882"         NaN

In [26]:
data = data[data['subcategory_id']!='total']

In [27]:
data[data['subcategory_id']=='total']

Empty DataFrame
Columns: [subcategory_id, source, visits, Unnamed: 3]
Index: []

In [28]:
data['visits'] = data['visits'].astype('int')

<ipython-input-28-c5deef310c65>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['visits'] = data['visits'].astype('int')

In [29]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1928 entries, 0 to 1928
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1928 non-null   object
 1   source          1928 non-null   object
 2   visits          1928 non-null   int32
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), int32(1), object(2)
memory usage: 67.8+ KB

In [31]:
data.groupby('source')['visits'].sum()

source
direct     2368980
organic    5687407
Name: visits, dtype: int32